<template>
  <div>

    <div class="service-agreement">

      <p>请阅读并确认以下服务协议：</p>

      <div>
        <h3>Hi汇文用户服务协议</h3>

        <h4>一、服务协议的确定</h4>
        <p>Hi汇文（hi.nkmun.cn）（以下简称“本系统”），隶属汇文国际中学生模拟联合国大会组委会（以下简称“汇文国际”），根据相关法律、法规进行汇文国际所属会议报名。依照本协议以下条款在本系统登记注册的领队（以下简称 “用户”），并同意以下服务条款，方有资格享受Hi汇文提供的相应服务，并受本协议条款的约束。</p>

        <h4>二、内容所有权</h4>
        <ol>
          <li>本系统所有内容和服务，包括但不限于系统的整体结构、网页设计、文字、图片、图表、源代码以及本系统为用户提供的其它信息或资料，其知识产权属汇文国际中学生模拟联合国大会组委会所有。未经大会组委书面许可，任何人不得进行复制或者以其它方式进行非法使用。</li>
          <li>用户只有在获得汇文国际或其他相关权利人的授权之后才能使用这些内容，而不能擅自复制、再造这些内容、或创造与内容有关的派生产品。</li>
        </ol>

        <h4>三、用户信息的提供</h4>
        <p>为保障用户的合法权益，避免在服务时因用户注册资料与真实情况不符而发生纠纷，请用户注册时务必按照真实、全面、准确的原则填写。对因用户自身原因而造成的不能服务情况，汇文国际概不负责。如果用户提供的资料包含有不正确的信息，本系统保留结束该用户使用服务资格的权利。 在注册和使用本系统服务的所有时间内，用户应提供真实、最新、有效及完整的资料和信息（包括但不限于指导教师、领队和代表的身份信息）并保证自用户注册之时起至本届大会结束的所有期间，其所提交的所有资料和信息有效性及真实性。</p>

        <h4>四、用户资料隐私保护</h4>
        <ol>
          <li>本系统保证不对外公开或向第三方提供用户注册资料及用户在使用网络服务时存储在本系统的非公开内容，但下列情况除外： <br> 　　（a）事先获得用户的明确授权； <br> 　　（b）根据有关的法律法规要求； <br> 　　（c）按照相关政府主管部门的要求； <br> 　　（d）为维护社会公众的利益； </li>
          <li>本系统可能会与第三方（如网络提供商）合作向用户提供相关的网络服务，在此情况下，如该第三方同意承担与本系统同等的保护用户隐私的责任，则本系统可将用户的注册资料等提供给该第三方。</li>
        </ol>

        <h4>五、用户资料安全</h4>
        <p>对用户注册信息本系统提供最大限度的安全保障。同时，用户务必对其用户密码、个人帐号等信息保密，以免被盗用或遭窜改。用户如发现上述情况请立即与本系统联系。</p>
        <p>用户在注册时向本系统提交的电子邮箱、用户名、密码等是本系统中的唯一识别信息。在注册成功后应妥善保管。如用户因忘记密码或密码被盗向大会组委申诉时，必须提供完整、正确的注册信息，否则本系统有权不予告知。</p>

        <h4>六、用户享有的权利和服务</h4>
        <ol>
          <li>用户有权随时对自己的个人资料进行查询、修改和删除。为客户服务安全考虑，帐号不能随意更改。</li>
          <li>本系统网络服务的具体内容由本系统根据实际情况提供（包括但不限于信息注册、名额交换、缴纳会费和与大会组委沟通）。本系统保留随时变更、中断或终止部分或全部网络服务的权利。</li>
          <li>用户理解，本系统仅提供相关的网络服务，除此之外与相关网络服务有关的设备（如电脑、调制解调器及其他与接入互联网有关的装置）及所需的费用（如为接入互联网而支付的电话费及上网费）均应由用户自行负担。</li>
        </ol>

        <h4>七、用户管理</h4>
        <p>不得利用本系统危害国家安全、泄露国家秘密，不得侵犯国家社会集体的和公民的合法权益，不得利用本系统制作、复制和传播下列信息：</p>
        <ol>
          <li>煽动抗拒、破坏宪法和法律、行政法规实施的；</li>
          <li>煽动颠覆国家政权，推翻社会主义制度的；</li>
          <li>煽动分裂国家、破坏国家统一的；</li>
          <li>煽动民族仇恨、民族歧视，破坏民族团结的；</li>
          <li>捏造或者歪曲事实，散布谣言，扰乱社会秩序的；</li>
          <li>宣扬封建迷信、淫秽、色情、赌博、暴力、凶杀、恐怖、教唆犯罪的；</li>
          <li>公然侮辱他人或者捏造事实诽谤他人的，或者进行其他恶意攻击的；</li>
          <li>损害国家机关信誉的；</li>
          <li>其他违反宪法和法律行政法规的；</li>
          <li>进行商业广告行为的。</li>
        </ol>
        <p>本系统声明用户的的系统记录有可能作为用户违反法律的证据。</p>

        <h4>八、免责声明</h4>
        <ol>
          <li>用户明确同意其使用本系统网络服务所存在的风险将完全由其自己承担；因其使用本系统网络服务而产生的一切后果也由其自己承担，本系统对用户不承担任何责任。</li>
          <li>本系统不担保网络服务一定能满足用户的要求，也不担保网络服务不会中断，对网络服务的及时性、安全性、准确性也都不作担保。</li>
        </ol>

        <h4>九、服务变更、中断或终止</h4>
        <ol>
          <li>如因系统维护或升级的需要而需暂停网络服务，本系统将尽可能事先进行通告。</li>
          <li>如发生下列任何一种情形，本系统有权随时中断或终止向用户提供本协议项下的网络服务而无需通知用户：<br> 　　（a）用户提供的个人资料不真实； <br> 　　（b）用户违反本协议中规定的使用规则。 </li>
          <li>除前款所述情形外，本系统同时保留在不事先通知用户的情况下随时中断或终止部分或全部网络服务的权利，对于所有服务的中断或终止而造成的任何损失，本系统无需对用户或任何第三方承担任何责任。</li>
        </ol>

        <h4>十、违约赔偿</h4>
        <p>用户同意保障和维护本系统及其他用户的利益，如因用户违反有关法律、法规或本协议项下的任何条款而给本系统或任何其他第三人造成损失，用户同意承担由此造成的损害赔偿责任。</p>

        <h4>十一、修改协议</h4>
        <ol>
          <li>本系统将可能不时的修改本协议的有关条款，一旦条款内容发生变动，本系统将会在相关的页面提示修改内容。</li>
          <li>如果不同意本系统对服务条款所做的修改，用户有权停止使用网络服务。如果用户继续使用网络服务，则视为用户接受服务条款的变动。</li>
        </ol>

        <h4>十二、法律管辖</h4>
        <ol>
          <li>本协议的订立、执行和解释及争议的解决均应适用中国法律。</li>
          <li>如双方就本协议内容或其执行发生任何争议，双方应尽量友好协商解决；协商不成时，任何一方均可向本系统所在地的人民法院提起诉讼。</li>
        </ol>

        <h4>十三、通知和送达</h4>
        <p>本协议项下所有的通知均可通过重要页面公告、电子邮件或常规的信件传送等方式进行；该等通知于发送之日视为已送达收件人。</p>

        <h4>十四、其他规定</h4>
        <ol>
          <li>本协议构成双方对本协议之约定事项及其他有关事宜的完整协议，除本协议规定的之外，未赋予本协议各方其他权利。</li>
          <li>如本协议中的任何条款无论因何种原因完全或部分无效或不具有执行力，本协议的其余条款仍应有效并且有约束力。</li>
          <li>本协议中的标题仅为方便而设，在解释本协议时应被忽略。</li>
        </ol>
        <p>本协议适用中华人民共和国法律，因任何一方出现违反法律的行为而造成协议条款的不能执行，都应由责任方自行负责并补偿由此而给对方造成的损失。</p>
        <p>本协议最终解释权属于汇文国际中学生模拟联合国大会组委会。</p>
      </div>

      <el-form
        :class="className"
        :model="M"
        ref="form"
      >
        <el-form-item
          prop="checked"
          :rules="validator"
        >
          <el-checkbox v-model="checked" @change="emit"> <b>我理解并同意以上服务协议</b> </el-checkbox>
        </el-form-item>
      </el-form>

    </div>

  </div>
</template>

<script>
import Precondition from '@/components/Precondition'

export default {
  name: 'service-agreement',
  components: {
    Precondition
  },
  props: {
    value: { type: Boolean },
    disabled: { type: Boolean, default: false },
    className: { type: String, default: '' },
  },
  data: () => ({
    serviceAgreement: null,
    checked: false,
    validator: {
      validator(r, v, cb) {
        return
        if ( v!== true )
          cb([ new Error('你必须同意许可协议才能继续') ])
        else
          cb([])
      }
    }
  }),
  computed: {
    M() { return { checked: this.checked } }
  },
  methods: {
    emit() {
      this.$nextTick( () => {
        this.$emit('input', this.checked)
        this.$emit('change', this.checked)
      })
    },
    reset() {
      this.setValue(null)
      this.emit()
    },
    validate() {
      return new Promise( resolve => {
        this.$refs.form.validate( resolve )
      })
    },
    setValue(value) {
      this.checked = value || false
      if (this.$refs.form && !value)
        this.$refs.form.resetFields()
    }
  },
  watch: {
    value(value) {
      this.setValue(value)
    }
  },
  created() {
    this.setValue(this.value)
  }
}
</script>
