<script>
export default {
  functional: true,
  render() {
    return (
      <div>
        <h4>报销细则</h4>
        <ol class="ol-1">
          <li>
            <h5>交通工具等级</h5>
            <ol class="ol-2">
              <li>乘坐动⻋车或⾼高铁，报销档次为⼆二等座，⼀一等座及商务座按同⻋车次⼆二等座标准报销；</li>
              <li>乘坐普通⽕火⻋车，报销档次最⾼高为硬卧，软卧按同⻋车次硬卧标准报销；</li>
              <li>乘坐⻜飞机，报销档次最⾼高为经济舱，头等舱商务舱按经济舱标准报销。</li>
            </ol>
          </li>

          <li>
            <h5>报销费用上限</h5>
            <p>报销按照实际花费报销，但存在报销上限，往来交通费报销⾦金金额上限800元。</p>
          </li>

          <li>
            <h5>有效报销标准</h5>
            <ol class="ol-2">
              <li>机票⾏行行程单和⽕火⻋车⾼高铁的票⾯面价格视为有效报销⾦金金额，额外购买的其他套餐不不予报销；</li>
              <li>由现居地(就读⼤大学所在地或家庭居住地)到南京的直达路路程或⾮非直达路路程(中转换乘 时间为6⼩小时以内)视为有效报销路路程；</li>
              <li>会前其他出发地以及会后其他⽬目的地到南京的路路程费⽤用与现居地到南京的直达路路程费⽤用 相⽐比，以较低⾦金金额作为有效报销⾦金金额；</li>
              <li>直达往返或者⾮非直达往返(中途换乘时间在6⼩小时以内)视为有效报销路路路路程；</li>
              <li>会前两天⾄至会后两天视为有效报销时间区间，提前或超过这⼀一区间的路路费不不予报销；</li>
              <li>南京籍主席不不给予路路费报销(特殊情况除外)。</li>
            </ol>
          </li>
        </ol>
      </div>
    )
  }
}
</script>